** A quick look at the homework and python dictionaries


#+BEGIN_SRC python :results silent :exports code :session *xor*
  import numpy as np
#+END_SRC


#+BEGIN_SRC python :results output :exports both :session *xor*
  wor   = [0.2,0.2,0.1]
  wand  = [0.2,0.2,-0.1]
  wnand = [-0.2,-0.2,0.3]
  wdict = {'or':wor,'and':wand,'nand':wnand}
  inputs = [[-1,-1,1],[-1,1,1],[1,-1,1],[1,1,1]]

  def checkfxn (inp,ws):
      interim = [(1 if (np.dot(inp,ws['or'])> 0) else -1),(1 if (np.dot(inp,ws['nand'])>0) else -1)]
      interim.append(1)
      return(1 if (np.dot(interim, ws['and']) > 0) else -1)
      
  for i in inputs:
      print(checkfxn(i,wdict))
#+END_SRC

#+RESULTS:
: -1
: 1
: 1
: -1

#+BEGIN_EXAMPLE
  -1
  1
  1
  -1
#+END_EXAMPLE

Python dictionaries: a convenient way to store values with names. A
dictionary is a key:value pairing, like in a dictionary you have the
word:definition. Look up the word, you get the definition. Here you look
up the key you get the value. I stored my weights for the different
booleans with their names.

